In [243]:
import pandas as pd

In [244]:
data = {
'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Frank'],
'Age': [25, 30, 35, 28, 32, 29],
'City': ['New York', 'London', 'New York', 'Paris', 'London', 'Tokyo'],
'Salary': [70000, 80000, 90000, 75000, 85000, 95000],
'Department': ['Sales', 'IT', 'Sales', 'IT', 'HR', 'IT']
}
df = pd.DataFrame(data)

In [245]:
df.head(3)

      Name  Age      City  Salary Department
0    Alice   25  New York   70000      Sales
1      Bob   30    London   80000         IT
2  Charlie   35  New York   90000      Sales

In [246]:
df.shape

(6, 5)

In [247]:
df.columns

Index(['Name', 'Age', 'City', 'Salary', 'Department'], dtype='object')

In [248]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         6 non-null      int64
 2   City        6 non-null      object
 3   Salary      6 non-null      int64
 4   Department  6 non-null      object
dtypes: int64(2), object(3)
memory usage: 372.0+ bytes

In [249]:
df['Age'].mean()

np.float64(29.833333333333332)

In [250]:
df[df['Age'] > 30]

      Name  Age      City  Salary Department
2  Charlie   35  New York   90000      Sales
4      Eve   32    London   85000         HR

In [251]:
df[df['Department']=="IT"]

    Name  Age    City  Salary Department
1    Bob   30  London   80000         IT
3  David   28   Paris   75000         IT
5  Frank   29   Tokyo   95000         IT

In [252]:
df['Salary'].max()

95000

In [253]:
df['City'].value_counts()

City
New York    2
London      2
Paris       1
Tokyo       1
Name: count, dtype: int64

In [254]:
df.groupby('Department')['Salary'].mean()

Department
HR       85000.000000
IT       83333.333333
Sales    80000.000000
Name: Salary, dtype: float64

In [255]:
df.sort_values('Salary', ascending=False)

      Name  Age      City  Salary Department
5    Frank   29     Tokyo   95000         IT
2  Charlie   35  New York   90000      Sales
4      Eve   32    London   85000         HR
1      Bob   30    London   80000         IT
3    David   28     Paris   75000         IT
0    Alice   25  New York   70000      Sales

In [256]:
df['Salary in thousand']= df['Salary']/1000

In [257]:
df[(df['City'] == 'New York') & (df['Salary'] > 75000)]

      Name  Age      City  Salary Department  Salary in thousand
2  Charlie   35  New York   90000      Sales                90.0

In [258]:
df['Department'].value_counts()

Department
IT       3
Sales    2
HR       1
Name: count, dtype: int64

In [259]:
df['Age group'] = df['Age'].apply(lambda x: 'Young' if x < 30 else 'Senior')